test_cases/3d_water/3d_flashingHotWaterNozzle/0_flashNozzle_snappyHexMesh_lowRes/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// in SnappyHexMesh most of this doesn't matter, can leave at defaults.

application     pisoFoam; 

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1;

maxCo		0.2;
maxAcousticCo	4;

adjustTimeStep 	true;

maxDeltaT	1e-5;

deltaT          1e-8; //start value

writeControl	adjustableRunTime;

writeInterval	1e-5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  9;

writeCompression on;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

// ************************************************************************* //
