test_cases/3d_water/3d_flashingHotWaterNozzle/0_flashNozzle_snappyHexMesh_lowRes/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     1.6;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh true;
snap            true;
addLayers       true;


geometry
{
    inlet.stl
    {
        type triSurfaceMesh;
        name inlet;
    }

    outlet.stl
    {
        type triSurfaceMesh;
        name outlet;
    }

    walls.stl
    {
        type triSurfaceMesh;
        name walls;
    }

    // Refinement Zones (custom)
    refineOutside 
    {
        type searchableCylinder;
        point1 (0 0 0.005);
        point2 (0 0 -0.0075);
        radius 0.0075;
    }

    refineInside
    {
        type searchableCylinder;
        point1 (0 0 0.002);
        point2 (0 0 -0.001);
        radius 0.00125;
    }

    reallyRefineInside
    {
        type searchableCylinder;
        point1 (0 0 0.0015);
        point2 (0 0 -0.0005);
        radius 0.0004;
    }

};


castellatedMeshControls
{
    maxLocalCells   100000000;
    maxGlobalCells  100000000;
    minRefinementCells 10;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 5;
    features
    (
	{
		file "walls.eMesh";
		level 1;
	}

        /*{
                file "inlet.eMesh";
                level 0;
        }*/

        /*{
                file "outlet.eMesh";
                level 0;
        }*/

    );
    refinementSurfaces
    {
	inlet
        {
            level (0 0);
        }

	outlet
        {
            level (0 0);
        }

        walls
        {
            level (1 2);
            gapLevelIncrement 2;
	}
    }
    resolveFeatureAngle 30;

    refinementRegions
    {
	refineOutside
        {
	    mode inside;
	    levels ((2 2));
        }

	refineInside
        {
	    mode inside;
	    levels ((2 3));
        }

	reallyRefineInside
        {
	    mode inside;
	    levels ((3 4));
        }
    }

    // Inside the STL volume
    // where mesh starts, usually set at origin for grid to be as symmetric as possible. 
    locationInMesh (0 0 -0.0004); 

    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch 3;
    tolerance 4.0;
    nSolveIter 30;
    nRelaxIter 5;
    nFeatureSnapIter 10;
}

addLayersControls
{
    relativeSizes true;
    
    layers
    {
	
        /*"walls"
        {
            nSurfaceLayers 5;
        }*/
     
        /*"inlet"
        {
            nSurfaceLayers 5;
        }*/

        /*"outlet"
        {
            nSurfaceLayers 5;
        }*/
	
    }

    expansionRatio 1.2;
    finalLayerThickness 0.5;
    minThickness 0.1;
    nGrow 0;
    featureAngle 60;
    nRelaxIter 8;
    nSmoothSurfaceNormals 3;
    nSmoothNormals 10;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle 130;
    nBufferCellsNoExtrude 0;
    nLayerIter 30;
    minMedialAxisAngle 130;
}

meshQualityControls
{
    maxNonOrtho 65; //80;
    maxBoundarySkewness 20;
    maxInternalSkewness 4; //5;
    maxConcave 80;
    minVol 1e-13;
    minTetQuality 1e-30;
    minArea -1;
    minTwist 0.02;
    minDeterminant 0.001;
    minFaceWeight 0.02;
    minVolRatio 0.01;
    minTriangleTwist -1;
    nSmoothScale 4;
    errorReduction 0.75;
}


// 0 : only write final meshes
// 1 : write intermediate meshes
// 2 : write volScalarField with cellLevel for postprocessing
// 4 : write current intersections as .obj files
debug 0;

mergeTolerance 1e-6;
